# AncillaryDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationAncillaryUsage..::..AncillaryDepth Property
FabricationAncillaryUsage Class See Also
---
Depth of required ancillary if it isn't round.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public double AncillaryDepth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AncillaryDepth As Double
	Get
```

Visual C++
---
```text
public:
property double AncillaryDepth {
	double get ();
}
```

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace